# Eksik Veri Silme Yöntemleri

In [1]:
import numpy as np
import pandas as pd
V1 = np.array([1,3,6,np.NaN,7,1,np.NaN,9,15])
V2 = np.array([7,np.NaN,5,8,12,np.NaN,np.NaN,2,3])
V3 = np.array([np.NaN,12,5,6,14,7,np.NaN,2,31])
df = pd.DataFrame(
        {"V1" : V1,
         "V2" : V2,
         "V3" : V3}        
)
df

     V1    V2    V3
0   1.0   7.0   NaN
1   3.0   NaN  12.0
2   6.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  12.0  14.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7   9.0   2.0   2.0
8  15.0   3.0  31.0

## İçinde herhangi bir değişken değerinde NaN olanları silelim

In [2]:
df.dropna()

     V1    V2    V3
2   6.0   5.0   5.0
4   7.0  12.0  14.0
7   9.0   2.0   2.0
8  15.0   3.0  31.0

## Sadece tüm değişken değerleri NaN olanları silelim

In [3]:
df.dropna(how ="all")

     V1    V2    V3
0   1.0   7.0   NaN
1   3.0   NaN  12.0
2   6.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  12.0  14.0
5   1.0   NaN   7.0
7   9.0   2.0   2.0
8  15.0   3.0  31.0

## Herhangi bir satırında NaN içeren sütunu silelim

In [5]:
df.dropna(axis = 1) # default axis = 0'dır => satır bazlı düşünür. axis = 1'de değişkeni yani sütunu siliyoruz.

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8]

## Tüm değerleri NaN olan sütunu(değişkeni) silelim.

In [6]:
df.dropna(axis = 1, how = "all")

     V1    V2    V3
0   1.0   7.0   NaN
1   3.0   NaN  12.0
2   6.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  12.0  14.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7   9.0   2.0   2.0
8  15.0   3.0  31.0

In [8]:
df["var_to_delete"] = np.nan
df

     V1    V2    V3  var_to_delete
0   1.0   7.0   NaN            NaN
1   3.0   NaN  12.0            NaN
2   6.0   5.0   5.0            NaN
3   NaN   8.0   6.0            NaN
4   7.0  12.0  14.0            NaN
5   1.0   NaN   7.0            NaN
6   NaN   NaN   NaN            NaN
7   9.0   2.0   2.0            NaN
8  15.0   3.0  31.0            NaN

In [13]:
df.dropna(axis = 1, how = "all", inplace = True)

In [14]:
df

     V1    V2    V3
0   1.0   7.0   NaN
1   3.0   NaN  12.0
2   6.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  12.0  14.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7   9.0   2.0   2.0
8  15.0   3.0  31.0